In [36]:
import pandas as pd

In [37]:
data = pd.read_csv('a.csv')
data.shape

(340, 3)

In [38]:
data.isna().sum()

Train ID      0
Weekdays      0
Cluster No    0
dtype: int64

In [39]:
data.head()

   Train ID       Weekdays  Cluster No
0     11045  0,0,0,0,0,1,0          19
1     11050  0,0,0,0,0,1,0           0
2     11079  0,0,0,0,1,0,0           2
3     11088  0,0,0,1,0,0,0           0
4     11090  0,0,0,0,0,0,1           0

In [40]:
def convert_comma_sep_to_string(s):
  return ''.join(s.split(','))

data['week'] = data['Weekdays'].apply(lambda x: convert_comma_sep_to_string(x))
data.head()

   Train ID       Weekdays  Cluster No     week
0     11045  0,0,0,0,0,1,0          19  0000010
1     11050  0,0,0,0,0,1,0           0  0000010
2     11079  0,0,0,0,1,0,0           2  0000100
3     11088  0,0,0,1,0,0,0           0  0001000
4     11090  0,0,0,0,0,0,1           0  0000001

In [41]:
def get_opposite_of_week(s):
  new = ''
  for char in s:
    if char == '0':
      new = new + '1'
    else:
      new = new + '0'
  return new

data['week_complement'] = data['week'].apply(lambda x: get_opposite_of_week(x))
data.head()

   Train ID       Weekdays  Cluster No     week week_complement
0     11045  0,0,0,0,0,1,0          19  0000010         1111101
1     11050  0,0,0,0,0,1,0           0  0000010         1111101
2     11079  0,0,0,0,1,0,0           2  0000100         1111011
3     11088  0,0,0,1,0,0,0           0  0001000         1110111
4     11090  0,0,0,0,0,0,1           0  0000001         1111110

In [42]:
def distance(str1, str2):
  count = 0
  for index in range(0, len(str1)):
    if str1[index] == str2[index]:
      count = count + 1
  return count

# example - distance('1111101', '0001000') = 2

In [43]:
def find_complement(x):
  # /**
  # This will receive a pandas row.
  # For each row, a list will be calculated - list of tuples (trainId, distance)
  # */
  # print(x)
  tuple_list = []
  subset_Df = data.loc[data['Cluster No'] == x['Cluster No']]
  trainsInSameCluster = subset_Df['Train ID'].unique()
  # print(trainsInSameCluster)

  i = 0
  for train in trainsInSameCluster:
    # compare a trains week_complement with all other train weeks in same cluster.
    baseTraincomplement = x['week_complement']
    compareWithTrainWeek = data.loc[data['Train ID'] == train].iloc[0]['week']
    
    # i = i + 1 FOR DEBUGGING
    # if i < 2:
    #   print(str(baseTraincomplement) + ' train id - ' + str(train) + ' week ' + str(compareWithTrainWeek))
    
    dist = distance(baseTraincomplement, compareWithTrainWeek)
    train_tuple = (train, dist)
    tuple_list.append(train_tuple)
  
  return tuple_list

data['complement'] = data.apply(lambda x: find_complement(x), axis=1) # row by row execute match function
data.head()

   Train ID  ...                                         complement
0     11045  ...                           [(11045, 0), (17610, 2)]
1     11050  ...  [(11050, 0), (11088, 2), (11090, 2), (11092, 2...
2     11079  ...  [(11079, 0), (11407, 2), (12103, 2), (12107, 4...
3     11088  ...  [(11050, 2), (11088, 0), (11090, 2), (11092, 2...
4     11090  ...  [(11050, 2), (11088, 2), (11090, 0), (11092, 2...

[5 rows x 6 columns]

In [44]:
data['complement'] = data['complement'].apply(lambda full_list: sorted(full_list, key=lambda item: item[1], reverse=True))
data.head()

   Train ID  ...                                         complement
0     11045  ...                           [(17610, 2), (11045, 0)]
1     11050  ...  [(12009, 5), (12216, 5), (12471, 5), (12931, 5...
2     11079  ...  [(15066, 5), (12107, 4), (12173, 3), (22129, 3...
3     11088  ...  [(82901, 7), (12009, 5), (12216, 5), (12931, 5...
4     11090  ...  [(12009, 7), (12931, 7), (19807, 5), (22959, 5...

[5 rows x 6 columns]

In [31]:
data.to_csv('results.csv')

In [27]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [45]:
data.to_csv('final_result.csv')
!cp final_result.csv "drive/My Drive/"

In [ ]:
## Reference Codes

distinct_cluster_list = data['Cluster No'].unique()
distinct_cluster_list

# [19,  0,  2, 24, 15,  7,  5, 11, 10, 28, 12,  6, 17, 22, 13, 25,  1,
      #  26,  3, 14, 18,  8, 20,  4, 16,  9, 21, 23, 29, 27]


for cluster in distinct_cluster_list:
  # unique_train_ids = data['Train ID'].where(data['Cluster No'] == cluster).unique()
  unique_train_ids = data.loc[data['Cluster No'] == cluster]['Train ID'].unique()
  print(unique_train_ids)

data.loc[data['Train ID'] == 11050].iloc[0]['week'] = '0100110'